recipes/almond-butter-tofu-stir-fry.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Almond butter tofu stir-fry</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Almond butter tofu stir-fry</h1>
<p>
<a href="https://minimalistbaker.com/almond-butter-tofu-stir-fry/">Original link</a>
</p>

<div id="outline-container-org1e05c37" class="outline-2">
<h2 id="org1e05c37">Ingredients</h2>
<div class="outline-text-2" id="text-org1e05c37">
</div>
<div id="outline-container-orgc72e376" class="outline-3">
<h3 id="orgc72e376">Tofu</h3>
<div class="outline-text-3" id="text-orgc72e376">
<ul class="org-ul">
<li>340 g package extra firm tofu</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4375ef" class="outline-3">
<h3 id="orgc4375ef">Marinade</h3>
<div class="outline-text-3" id="text-orgc4375ef">
<ul class="org-ul">
<li>2 Tbsp sesame oil (divided)</li>
<li>4 Tbsp reduced-sodium tamari (or soy sauce if not GF)</li>
<li>3 Tbsp maple syrup</li>
<li>2 Tbsp almond butter (or sub peanut butter)</li>
<li>2 Tbsp lime juice</li>
<li>1-2 tsp chili garlic sauce (or 1/2 tsp red pepper flake)</li>
</ul>
</div>
</div>

<div id="outline-container-orgff0ca75" class="outline-3">
<h3 id="orgff0ca75">Veggies</h3>
<div class="outline-text-3" id="text-orgff0ca75">
<ul class="org-ul">
<li>453 g green beans (trimmed)</li>
<li>2-3 small spicy peppers (I used cherry bomb - use bell peppers for less heat)</li>
</ul>
</div>
</div>

<div id="outline-container-orgfaa08da" class="outline-3">
<h3 id="orgfaa08da">Serving (optional)</h3>
<div class="outline-text-3" id="text-orgfaa08da">
<ul class="org-ul">
<li>Brown rice, white rice, or Cauliflower Rice</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc39a31e" class="outline-2">
<h2 id="orgc39a31e">Method</h2>
<div class="outline-text-2" id="text-orgc39a31e">
<ol class="org-ol">
<li>Preheat oven to 200&deg;C and line a baking sheet with parchment paper. Also
wrap tofu in a clean, absorbent towel and set something heavy on top - like
a cast-iron skillet - to press out excess moisture.</li>
<li>Once oven is preheated, unwrap tofu and cut into small cubes. Arrange on
the lined baking sheet in an even layer and bake for 25-30 minutes or until
puffy, dried out, and slightly crispy on the edges (see photo). This step
helps crisp up the tofu. The longer you bake it, the firmer and crispier it
will get, so adjust cooking time accordingly.</li>
<li>In the meantime, to a small mixing bowl, add half of the sesame oil (1 Tbsp
as original recipe is written // adjust if altering batch size), tamari,
maple syrup, almond butter, lime juice, and chili garlic sauce/red pepper
flake/Thai chilies. Whisk to combine. Then taste and adjust flavor as
needed, adding more almond butter for creaminess / nuttiness, tamari for
saltiness, lime juice for acidity, or chili garlic sauce for heat. Set
aside.</li>
<li>If serving with rice, prepare at this time (see notes).</li>
<li>Add baked tofu to the almond butter-tamari sauce and let marinate for 5
minutes, stirring occasionally. The longer it marinates, the more intense
the flavor, but I find 5-10 minutes to be sufficient.</li>
<li>Heat a large skillet over medium heat. Once hot, add the tofu, leaving most
of the marinade behind (this will be added to the vegetables for flavor).</li>
<li>Cook for about 5 minutes, stirring occasionally, until browned on all sides
and slightly caramelized. Remove from pan and set aside.</li>
<li>To the skillet, add remaining sesame oil (1 Tbsp as original recipe is
written / adjust if altering batch size), green beans and peppers and 2-3
Tbsp (30-45 ml / amount as original recipe is written / adjust if altering
batch size) of the marinade. Cover to steam for about 4-5 minutes or until
green beans are slightly tender. Then remove lid, increase heat to medium
high, and add remaining marinade and the tofu. Cook for an additional 1-2
minutes, stirring frequently. Then remove from heat.</li>
<li>Serve as is or over cooked rice or cauliflower rice. For more heat, serve
with chili garlic sauce or Sriracha.</li>
<li>Best when fresh. Store leftovers in the refrigerator up to 3 days. Reheat
on the stovetop or in the microwave until hot.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
